#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_objectstorage_object.templated_config["config/infisical-config/agent-config.yaml"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "c2f338455b825bbc68cbf06334059f4e"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/agent-config.yaml"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/freshrss.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "da555927659b39833e6ddffaf6074258"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/freshrss.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/healthcheck-urls.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "fbe972182c1cff5d32f2886c2408ea0f"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/healthcheck-urls.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/nitter.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "76a7b0e2bf612e30a0999334127b7c20"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/nitter.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/planka-postgres.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "52e061ad6b7abf0fc34bcad19a28c3a7"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/planka-postgres.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/planka.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "528575a603e725df7301afd54a356cba"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/planka.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

  # oci_objectstorage_object.templated_config["config/infisical-config/templates/redlib.env.tmpl"] will be created
  + resource "oci_objectstorage_object" "templated_config" {
      + bucket                     = "oci-apps"
      + content                    = "050721e570743e49c63fff25d862b0f3"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = "text/plain"
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "lrky0f1nmots"
      + object                     = "config/infisical-config/templates/redlib.env.tmpl"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```